{"store": "ChromeWS", "id": "laankejkbhbdhmipfmgcngdelahlfoji", "app_key": "cws:laankejkbhbdhmipfmgcngdelahlfoji", "title": "StayFocusd – Website Blocker & Focus Timer & Shorts Blocker", "developer": "TraderThis developer has identified itself as a trader per the definition from the European Union and committed to only offer products or services that comply with EU laws.", "category": "Follows recommended practices for Chrome extensions. Learn more.", "rating_avg": 4.5, "rating_count": 8400, "rating_histogram": null, "installs_or_users": 600000, "pricing_raw": "Free", "website_url": null, "website_content_raw": null, "store_url": "https://chromewebstore.google.com/detail/laankejkbhbdhmipfmgcngdelahlfoji?hl=en", "description": "OverviewBoost your productivity by limiting the amount of time you spend on time-wasting websites.You sit down at the computer, and you swear you'll be productive. Next thing you know, it's twelve hours later. You've checked your email, updated your Facebook status, blown through 200 pages of Reddit, read every article in your Twitter feed, looked up your favorite band on Wikipedia, vanity googled yourself, cyber-stalked your ex, browsed through all your high-school crushes' Instagram feeds, and lost a week's pay playing online poker. What you haven't done is WORK. ✦ What is StayFocusd? StayFocusd, by Sensor Tower, is a productivity extension for Google Chrome that helps you stay focused on work by restricting the amount of time you can spend on time-wasting websites. It provides analytics to help you understand and control your internet usage, ensuring you remain productive throughout the day. ⭐ Our Features ⭐ 📊 Website usage history: Get statistics of your daily website usage history. 🚫 Configurable blocking: Block entire sites, specific subdomains, specific paths, specific pages, or even in-page content (videos, images, forms, etc). ☢️ The Nuclear Option: This powerful feature allows you to block access to websites for the number of hours you specify on the days you choose. Once activated, it cannot be canceled, ensuring you remain focused and productive. 📱Require Challenge: To change any settings, you must complete a challenging task. This reduces the temptation to alter settings, helping you stick to your productivity goals. 🗓️ Active Days/Hours: Customize the days and hours during which StayFocusd will restrict your access to distracting websites. This ensures that your productivity is maintained during critical work periods. ▶️ In App Blocking for YouTube: Block all distracting components on YouTube. Hide shorts, comments, recommended videos, etc. 🔒", "release_date": null, "last_update": "Flag concern", "version": "UpdatedOctober 2, 2025", "icon_url": "https://lh3.googleusercontent.com/lhTfr_0i-RaJD_KXtlfqGQf4C9Y8RPtI3NeRA9uP90fN74tFiI-IVzv282ZqB8_uCD3DFhcOmOWZCsmv8gq0xG6VQQ=s128-rj-sc0x00ffffff", "scraped_at": "2025-10-03"}
